app/interactors/poi_interactor.rb

  def create_new_poi(poi_params)
    poi = PointOfInterest.new(poi_params)

    [poi.save, poi]
---
INSERT INTO "point_of_interests" ("name", "x", "y", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "novo ponto"], ["x", 20], ["y", 40], ["created_at", "2020-05-14 18:14:42.945234"], ["updated_at", "2020-05-14 18:14:42.945234"]]